{"data":{"markdownRemark":{"frontmatter":{"title":"Updates","subtitle":"All updates"}},"allMarkdownRemark":{"edges":[{"node":{"id":"8e3efe3b-c480-512a-b978-adb59645a26d","html":"<p><strong>Abstract</strong></p>\n<p>Heart disease, one of the major causes of mortality worldwide, can be mitigated by early heart disease diagnosis. A clinical decision support system (CDSS) can be used to diagnose the subjects’ heart disease status earlier. This study proposes an effective heart disease prediction model (HDPM) for a CDSS which consists of Density-Based Spatial Clustering of Applications with Noise (DBSCAN) to detect and eliminate the outliers, a hybrid Synthetic Minority Over-sampling Technique-Edited Nearest Neighbor (SMOTE-ENN) to balance the training data distribution and XGBoost to predict heart disease. Two publicly available datasets (Statlog and Cleveland) were used to build the model and compare the results with those of other models (naive bayes (NB), logistic regression (LR), multilayer perceptron (MLP), support vector machine (SVM), decision tree (DT), and random forest (RF)) and of previous study results. The results revealed that the proposed model outperformed other models and previous study results by achieving accuracies of 95.90% and 98.40% for Statlog and Cleveland datasets, respectively. In addition, we designed and developed the prototype of the Heart Disease CDSS (HDCDSS) to help doctors/clinicians diagnose the patients’/subjects’ heart disease status based on their current condition. Therefore, early treatment could be conducted to prevent the deaths caused by late heart disease diagnosis.</p>\n<p>Published in: IEEE Access<br/>\nDOI: <a target='_blank' alt='' rel='noopener noreferrer' href='https://doi.org/10.1109/ACCESS.2020.3010511'>10.1109/ACCESS.2020.3010511</a></p>","fields":{"slug":"/updates/2020-07-20-HDPM-An-Effective-Heart-Disease-Prediction-Model-for-a-Clinical-Decision-Support-System/"},"frontmatter":{"title":"HDPM-An Effective Heart Disease Prediction Model for a Clinical Decision Support System","description":null,"date":"20 July 2020","tags":["paper","journal","heart disease","health informatics","machine learning"]}}},{"node":{"id":"a3a8dedf-034e-5e3c-aebb-0f5011af8b2c","html":"<p><strong>Abstract</strong></p>\n<p>Predicting future blood glucose (BG) level for diabetic patients will help them to avoid critical conditions in the future. This study proposed Extreme Gradient Boosting (XGBoost), an ensemble learning model to predict the future blood glucose value of diabetic patients. The clinical dataset of Type 1 Diabetes (T1D) patients was utilized and the prediction models were generated to predict future BG of 30 and 60 minutes ahead of time. The prediction models have been tested tofive children who develop T1D and showed that BG prediction model based on XGBoost outperformed other models, with average of Root Mean Square Error (RMSE) are 23.219 mg/dL and 35.800 mg/dL for prediction horizon (PH) 30 and 60 minutes respectively. In addition, the result showed that by utilizing statistical-based features as additional attributes, most of the performance of predictions model were increased.</p>\n<p>Published in: IOP Conference Series: Materials Science and Engineering<br/>\nDOI: <a target='_blank' alt='Blood Glucose Prediction Model for Type 1 Diabetes based on Extreme Gradient Boosting' rel='noopener noreferrer' href='https://doi.org/10.1088/1757-899X/803/1/012012'>10.1088/1757-899X/803/1/012012</a></p>","fields":{"slug":"/updates/2020-05-01-Blood-Glucose-Prediction-Model-for-Type-1-Diabetes-based-on-Extreme-Gradient-Boosting/"},"frontmatter":{"title":"Blood Glucose Prediction Model for Type 1 Diabetes based on Extreme Gradient Boosting","description":null,"date":"01 May 2020","tags":["paper","conference","diabetes","machine learning","health informatics"]}}},{"node":{"id":"4b0167a7-4fb7-5e85-be61-2f4133925bcd","html":"<p><strong>Abstract</strong></p>\n<p>Understanding customer shopping behavior in retail store is important to improve the customers' relationship with the retailer, which can help to lift the revenue of the business. However, compared to online store, the customer browsing activities in the retail store is difficult to be analysed. Therefore, in this study the customer shopping behavior analysis (i.e., browsing activity) in retail store by utilizing radio frequency identification (RFID)-enabled shelf and machine learning model is proposed. First, the RFID technology is installed in the store shelf to monitor the movement tagged products. The dataset was gathered from receive signal strength (RSS) of the tags for different customer behavior scenario. The statistical features were extracted from RSS of tags. Finally, machine learning models were utilized to classify different customer shopping activities. The experiment result showed that the proposed model based on Multilayer Perceptron (MLP) outperformed other models by as much as 97.00%, 96.67%, 97.50%, and 96.57% for accuracy, precision, recall, and f-score, respectively. The proposed model can help the managers better understand what products customer interested in, so that can be utilized for product placement, promotion as well as relevant product recommendations to the customers.</p>\n<p>Published in: IOP Conference Series: Materials Science and Engineering<br/>\nDOI: <a target='_blank' alt='In-store Customer Shopping Behavior Analysis by Utilizing RFID-enabled Shelf and Multilayer Perceptron Model' rel='noopener noreferrer' href='https://doi.org/10.1088/1757-899X/803/1/012022'>10.1088/1757-899X/803/1/012022</a></p>","fields":{"slug":"/updates/2020-05-01-In-store-Customer-Shopping-Behavior-Analysis-by-Utilizing-RFID-enabled-Shelf-and-Multilayer-Perceptron-Model/"},"frontmatter":{"title":"In-store Customer Shopping Behavior Analysis by Utilizing RFID-enabled Shelf and Multilayer Perceptron Model","description":null,"date":"01 May 2020","tags":["paper","conference","rfid","machine learning"]}}},{"node":{"id":"40268397-a9ff-5198-928b-8a4d41efbcd5","html":"<p><strong>Abstract</strong></p>\n<p>Radio Frequency Identification (RFID) technology has significantly improved in the past few years and is presently sought for implementation in the identification and traceability of perishable food in the food sector to safeguard food safety and quality. It is currently considered a worthy successor to the barcode system and has significant advantages for monitoring products in the perishable food supply chain (PFSC). The present study proposes a traceability system that utilizes RFID and Internet of Things (IoT) sensors. RFID technology can be used to track and trace perishable food while IoT sensors can be used to measure temperature and humidity during storage and transportation. Furthermore, it is important that RFID gates can identify the direction of tags and whether products are being received or shipped through the gate. In this study, machine-learning models are utilized to detect the direction of passive RFID tags. The input features are derived from receive signal strength (RSS) and the timestamp of tags. The proposed system has been tested in the perishable food supply chain and has revealed significant benefits to managers and customers by providing real-time product information and complete temperature and humidity history. In addition, by integrating a machine-learning model into the RFID gate, tagged products that move in or out through a gate can be correctly identified and thus improve the efficiency of the traceability system.</p>\n<p>Published in: Food Control<br/>\nDOI: <a target='_blank' alt='' rel='noopener noreferrer' href='https://doi.org/10.1016/j.foodcont.2019.107016'>10.1016/j.foodcont.2019.107016</a></p>","fields":{"slug":"/updates/2019-11-28-Improving-Efficiency-of-RFID-based-Traceability-System-for-Perishable-Food-by-Utilizing-IoT-Sensors-and-Machine-Learning-Model/"},"frontmatter":{"title":"Improving Efficiency of RFID-based Traceability System for Perishable Food by Utilizing IoT Sensors and Machine Learning Model","description":null,"date":"28 November 2019","tags":["paper","journal","rfid","food quality","machine learning"]}}},{"node":{"id":"9fac4461-3249-5586-ba28-ff74b4a21245","html":"<p><strong>Abstract</strong></p>\n<p>Early diseases prediction plays an important role for improving healthcare quality and can help individuals avoid dangerous health situations before it is too late. This paper proposes a disease prediction model (DPM) to provide an early prediction for type 2 diabetes and hypertension based on individual’s risk factors data. The proposed DPM consists of isolation forest (iForest) based outlier detection method to remove outlier data, synthetic minority oversampling technique tomek link (SMOTETomek) to balance data distribution, and ensemble approach to predict the diseases. Four datasets were utilized to build the model and extract the most significant risks factors. The results showed that the proposed DPM achieved highest accuracy when compared to other models and previous studies. We also developed a mobile application to provide the practical application of the proposed DPM. The developed mobile application gathers risk factor data and send it to a remote server, so that an individual’s current condition can be diagnosed with the proposed DPM. The prediction result is then sent back to the mobile application; thus, immediate and appropriate action can be taken to reduce and prevent individual’s risks once unexpected health situations occur (i.e., type 2 diabetes and/or hypertension) at early stages.</p>\n<p>Published in: IEEE Access<br/>\nDOI: <a target='_blank' alt='' rel='noopener noreferrer' href='https://doi.org/10.1109/ACCESS.2019.2945129'>10.1109/ACCESS.2019.2945129</a></p>","fields":{"slug":"/updates/2019-10-02-Development-of-Disease-Prediction-Model-Based-on-Ensemble-Learning-Approach-for-Diabetes-and-Hypertension/"},"frontmatter":{"title":"Development of Disease Prediction Model Based on Ensemble Learning Approach for Diabetes and Hypertension","description":null,"date":"02 October 2019","tags":["paper","journal","diabetes","hypertension","health informatics","machine learning"]}}},{"node":{"id":"8e699cc2-a214-55b5-ade4-f66918efb680","html":"<p><strong>Abstract</strong></p>\n<p>Radio frequency identification (RFID) is an automated identification technology that can be utilized to monitor product movements within a supply chain in real-time. However, one problem that occurs during RFID data capturing is false positives (i.e., tags that are accidentally detected by the reader but not of interest to the business process). This paper investigates using machine learning algorithms to filter false positives. Raw RFID data were collected based on various tagged product movements, and statistical features were extracted from the received signal strength derived from the raw RFID data. Abnormal RFID data or outliers may arise in real cases. Therefore, we utilized outlier detection models to remove outlier data. The experiment results showed that machine learning-based models successfully classified RFID readings with high accuracy, and integrating outlier detection with machine learning models improved classification accuracy. We demonstrated the proposed classification model could be applied to real-time monitoring, ensuring false positives were filtered and hence not stored in the database. The proposed model is expected to improve warehouse management systems by monitoring delivered products to other supply chain partners.</p>\n<p>Published in: Applied Sciences<br/>\nDOI: <a target='_blank' alt='' rel='noopener noreferrer' href='https://doi.org/10.3390/app9061154'>10.3390/app9061154</a></p>","fields":{"slug":"/updates/2019-03-19-False-Positive-RFID-Detection-Using-Classification-Models/"},"frontmatter":{"title":"False Positive RFID Detection Using Classification Models","description":null,"date":"19 March 2019","tags":["paper","journal","rfid","machine learning"]}}},{"node":{"id":"4b8c9628-0d2f-588c-aa1f-2bfbf6dd395b","html":"<p><strong>Abstract</strong></p>\n<p><em>Purpose</em></p>\n<p>The purpose of this paper is to propose customer behavior analysis based on real-time data processing and association rule for digital signage-based online store (DSOS). The real-time data processing based on big data technology (such as NoSQL MongoDB and Apache Kafka) is utilized to handle the vast amount of customer behavior data.</p>\n<p><em>Design/methodology/approach</em> </p>\n<p>In order to extract customer behavior patterns, customers’ browsing history and transactional data from digital signage (DS) could be used as the input for decision making. First, the authors developed a DSOS and installed it in different locations, so that customers could have the experience of browsing and buying a product. Second, the real-time data processing system gathered customers’ browsing history and transaction data as it occurred. In addition, the authors utilized the association rule to extract useful information from customer behavior, so it may be used by the managers to efficiently enhance the service quality.</p>\n<p><em>Findings</em> </p>\n<p>First, as the number of customers and DS increases, the proposed system was capable of processing a gigantic amount of input data conveniently. Second, the data set showed that as the number of visit and shopping duration increases, the chance of products being purchased also increased. Third, by combining purchasing and browsing data from customers, the association rules from the frequent transaction pattern were achieved. Thus, the products will have a high possibility to be purchased if they are used as recommendations.</p>\n<p><em>Research limitations/implications</em> </p>\n<p>This research empirically supports the theory of association rule that frequent patterns, correlations or causal relationship found in various kinds of databases. The scope of the present study is limited to DSOS, although the findings can be interpreted and generalized in a global business scenario.</p>\n<p><em>Practical implications</em> </p>\n<p>The proposed system is expected to help management in taking decisions such as improving the layout of the DS and providing better product suggestions to the customer.</p>\n<p><em>Social implications</em> </p>\n<p>The proposed system may be utilized to promote green products to the customer, having a positive impact on sustainability.</p>\n<p><em>Originality/value</em> </p>\n<p>The key novelty of the present study lies in system development based on big data technology to handle the enormous amounts of data as well as analyzing the customer behavior in real time in the DSOS. The real-time data processing based on big data technology (such as NoSQL MongoDB and Apache Kafka) is used to handle the vast amount of customer behavior data. In addition, the present study proposed association rule to extract useful information from customer behavior. These results can be used for promotion as well as relevant product recommendations to DSOS customers. Besides in today’s changing retail environment, analyzing the customer behavior in real time in DSOS helps to attract and retain customers more efficiently and effectively, and retailers can get a competitive advantage over their competitors.</p>\n<p>Published in: Asia Pacific Journal of Marketing and Logistics<br/>\nDOI: <a href=\"https://doi.org/10.1108/APJML-03-2018-0088\">10.1108/APJML-03-2018-0088</a></p>","fields":{"slug":"/updates/2019-01-14-Customer-behavior-analysis-using-real-time-data-processing-A-case-study-of-digital-signage-based-online-stores/"},"frontmatter":{"title":"Customer behavior analysis using real-time data processing A case study of digital signage-based online stores","description":null,"date":"14 January 2019","tags":["paper","journal","rfid","machine learning"]}}},{"node":{"id":"4ab4822e-16fd-59c9-9c6c-06280f65dc76","html":"<p><strong>Abstract</strong></p>\n<p>Maintaining product quality is essential for smart factories, hence detecting abnormal events in assembly line is important for timely decision-making. This study proposes an affordable fast early warning system based on edge computing to detect abnormal events during assembly line. The proposed model obtains environmental data from various sensors including gyroscopes, accelerometers, temperature, humidity, ambient light, and air quality. The fault model is installed close to the facilities, so abnormal events can be timely detected. Several performance evaluations are conducted to obtain the optimal scenario for utilizing edge devices to improve data processing and analysis speed, and the final proposed model provides the highest accuracy in terms of detecting abnormal events compared to other classification models. The proposed model was tested over four months of operation in a Korean automobile parts factory, and provided significant benefits from monitoring assembly line, as well as classifying abnormal events. The model helped improve decision-making by reducing or preventing unexpected losses due to abnormal events.</p>\n<p>Published in: Applied Sciences<br/>\nDOI: <a href=\"https://doi.org/10.3390/app9010084\">10.3390/app9010084</a></p>","fields":{"slug":"/updates/2019-01-09-An-Affordable-Fast-Early-Warning-System-for-Edge-Computing-in-Assembly-Line/"},"frontmatter":{"title":"An Affordable Fast Early Warning System for Edge Computing in Assembly Line","description":null,"date":"09 January 2019","tags":["paper","journal","manufacturing","edge-computing","IoT","machine learning"]}}},{"node":{"id":"0a4e7b31-2692-5eea-9492-b804f9704016","html":"<p><strong>Abstract</strong></p>\n<p>Current technology such as Bluetooth Low Energy (BLE) provides an efficient way for Real-Time Location System (RTLS). This study proposes a BLE-based Real-Time Location System that utilizes Smartphone and NoSQL database as gateway and data storage respectively. Firstly, we develop a smartphone-based tracking app to gather the location of employees. Secondly, the generated sensor data from gateway is then stored into NoSQL MongoDB. The proposed system was tested for monitoring the movement of employees in the workplace. The results showed that commercial versions of the BLE-based device and the proposed system are sufficiently efficient for RTLS. Furthermore, proposed system is capable of processing a massive input/output of sensor data efficiently when the number of BLE-based devices and users increases.</p>\n<p>Published in: BDIOT 2018 Proceedings of the 2018 2nd International Conference on Big Data and Internet of Things, ACM New York, NY, USA ©2018 <br/>\nDOI: <a href=\"https://doi.org/10.1145/3289430.3289470\">10.1145/3289430.3289470</a></p>","fields":{"slug":"/updates/2018-10-24-Application-of-Bluetooth-Low-Energy-Based-Real-Time-Location-System-for-Indoor-Environments/"},"frontmatter":{"title":"Application of Bluetooth Low Energy-Based Real-Time Location System for Indoor Environments","description":null,"date":"24 October 2018","tags":["paper","conference","BLE","real-time monitoring","IoT"]}}},{"node":{"id":"e2c448ab-0c81-5513-84c1-60dcc0b442bd","html":"<p><strong>Abstract</strong></p>\n<p>With the increase in the amount of data captured during the manufacturing process, monitoring systems are becoming important factors in decision making for management. Current technologies such as Internet of Things (IoT)-based sensors can be considered a solution to provide efficient monitoring of the manufacturing process. In this study, a real-time monitoring system that utilizes IoT-based sensors, big data processing, and a hybrid prediction model is proposed. Firstly, an IoT-based sensor that collects temperature, humidity, accelerometer, and gyroscope data was developed. The characteristics of IoT-generated sensor data from the manufacturing process are: real-time, large amounts, and unstructured type. The proposed big data processing platform utilizes Apache Kafka as a message queue, Apache Storm as a real-time processing engine and MongoDB to store the sensor data from the manufacturing process. Secondly, for the proposed hybrid prediction model, Density-Based Spatial Clustering of Applications with Noise (DBSCAN)-based outlier detection and Random Forest classification were used to remove outlier sensor data and provide fault detection during the manufacturing process, respectively. The proposed model was evaluated and tested at an automotive manufacturing assembly line in Korea. The results showed that IoT-based sensors and the proposed big data processing system are sufficiently efficient to monitor the manufacturing process. Furthermore, the proposed hybrid prediction model has better fault prediction accuracy than other models given the sensor data as input. The proposed system is expected to support management by improving decision-making and will help prevent unexpected losses caused by faults during the manufacturing process.</p>\n<p>Published in: Sensors<br/>\nDOI: <a href=\"https://doi.org/10.3390/s18092946\">10.3390/s18092946</a></p>","fields":{"slug":"/updates/2018-09-05-Performance-Analysis-of-IoT-Based-Sensor,-Big-Data-Processing,-and-Machine-Learning-Model-for-Real-Time-Monitoring-System-in-Automotive-Manufacturing/"},"frontmatter":{"title":"Performance Analysis of IoT-Based Sensor, Big Data Processing, and Machine Learning Model for Real-Time Monitoring System in Automotive Manufacturing","description":null,"date":"05 September 2018","tags":["paper","journal","manufacturing","big data","IoT","machine learning","real-time monitoring"]}}},{"node":{"id":"53e01c7c-e825-58fe-8d65-2a1337d456bf","html":"<p><strong>Abstract</strong></p>\n<p>As the risk of diseases diabetes and hypertension increases, machine learning algorithms are being utilized to improve early stage diagnosis. This study proposes a Hybrid Prediction Model (HPM), which can provide early prediction of type 2 diabetes (T2D) and hypertension based on input risk-factors from individuals. The proposed HPM consists of Density-based Spatial Clustering of Applications with Noise (DBSCAN)-based outlier detection to remove the outlier data, Synthetic Minority Over-Sampling Technique (SMOTE) to balance the distribution of class, and Random Forest (RF) to classify the diseases. Three benchmark datasets were utilized to predict the risk of diabetes and hypertension at the initial stage. The result showed that by integrating DBSCAN-based outlier detection, SMOTE, and RF, diabetes and hypertension could be successfully predicted. The proposed HPM provided the best performance result as compared to other models for predicting diabetes as well as hypertension. Furthermore, our study has demonstrated that the proposed HPM can be applied in real cases in the IoT-based Health-care Monitoring System, so that the input risk-factors from end-user android application can be stored and analyzed in a secure remote server. The prediction result from the proposed HPM can be accessed by users through an Android application; thus, it is expected to provide an effective way to find the risk of diabetes and hypertension at the initial stage.</p>\n<p>Published in: Applied Sciences<br/>\nDOI: <a href=\"https://doi.org/10.3390/app8081325\">10.3390/app8081325</a></p>","fields":{"slug":"/updates/2018-08-08-Hybrid-Prediction-Model-for-Type-2-Diabetes-and-Hypertension-Using-DBSCAN-Based-Outlier-Detection-Synthetic-Minority-Over-Sampling-Technique-(SMOTE)-and-Random-Forest/"},"frontmatter":{"title":"Hybrid Prediction Model for Type 2 Diabetes and Hypertension Using DBSCAN-Based Outlier Detection, Synthetic Minority Over Sampling Technique (SMOTE), and Random Forest","description":null,"date":"08 August 2018","tags":["paper","journal","healthcare","diabetes","hypertension","machine learning"]}}},{"node":{"id":"09af1d4a-8214-581c-8a4e-a85fe46af16c","html":"<p><strong>Abstract</strong></p>\n<p>Current technology provides an efficient way of monitoring the personal health of individuals. Bluetooth Low Energy (BLE)-based sensors can be considered as a solution for monitoring personal vital signs data. In this study, we propose a personalized healthcare monitoring system by utilizing a BLE-based sensor device, real-time data processing, and machine learning-based algorithms to help diabetic patients to better self-manage their chronic condition. BLEs were used to gather users’ vital signs data such as blood pressure, heart rate, weight, and blood glucose (BG) from sensor nodes to smartphones, while real-time data processing was utilized to manage the large amount of continuously generated sensor data. The proposed real-time data processing utilized Apache Kafka as a streaming platform and MongoDB to store the sensor data from the patient. The results show that commercial versions of the BLE-based sensors and the proposed real-time data processing are sufficiently efficient to monitor the vital signs data of diabetic patients. Furthermore, machine learning–based classification methods were tested on a diabetes dataset and showed that a Multilayer Perceptron can provide early prediction of diabetes given the user’s sensor data as input. The results also reveal that Long Short-Term Memory can accurately predict the future BG level based on the current sensor data. In addition, the proposed diabetes classification and BG prediction could be combined with personalized diet and physical activity suggestions in order to improve the health quality of patients and to avoid critical conditions in the future.</p>\n<p>Published in: Sensors<br/>\nDOI: <a href=\"https://doi.org/10.3390/s18072183\">10.3390/s18072183</a></p>","fields":{"slug":"/updates/2018-07-06-A-Personalized-Healthcare-Monitoring-System-for-Diabetic-Patients-by-Utilizing-BLE-Based-Sensors-and-Real-Time-Data-Processing/"},"frontmatter":{"title":"A Personalized Healthcare Monitoring System for Diabetic Patients by Utilizing BLE-Based Sensors and Real-Time Data Processing","description":null,"date":"06 July 2018","tags":["paper","journal","healthcare","diabetes","big data","machine learning","real-time monitoring","IoT"]}}},{"node":{"id":"a87a9631-d1c6-5769-8627-a4b2cfc80b98","html":"<p><strong>Abstract</strong></p>\n<p>Now days, customer’s health awareness is of extreme significance. Food can become contaminated at any point during production, distribution and preparation. Therefore, it is of key importance for the perishable food supply chain to monitor the food quality and safety. Traceability system offers complete food information and therefore, it guarantees food quality and safety. The current study postulates a low cost IoT-based traceability system that utilized RFID and smartphone-based sensors. The RFID handheld reader based on smartphone is utilized to track and trace product information. In addition the smartphone-based sensor is used to measure temperature, humidity, and location (based on GPS sensor) during storage and transportation. The proposed system was verified for kimchi supply chain in Korea, and revealed significant benefits to managers as well as customers by providing the real-time location as well as complete temperature and humidity history. The results displayed that compared to the traditional methods, the proposed system is capable of tracking products as well as processing an immense input of sensor data efficiently and effectively.</p>","fields":{"slug":"/updates/2018-02-21-A-Low-Cost-IoT-based-Traceability-System-for-Perishable-Food-Supply-Chain/"},"frontmatter":{"title":"A Low Cost IoT-based Traceability System for Perishable Food Supply Chain","description":null,"date":"21 February 2018","tags":["paper","conference","rfid","traceability","real-time monitoring"]}}},{"node":{"id":"1f3cb50d-84eb-513c-8c64-05c1721f2874","html":"<p><strong>Abstract</strong></p>\n<p>To make manufacturers more competitive, there is a need to integrate advanced computing and cyber-physical systems to take advantage of the current technologies. With the advent of smart sensors such as IoT technologies (1), collecting data has become a simple task, but the question remains if these devices or data provide the right information for the right purpose at the right time. Data is not useful unless it is processed in a way that provides context and meaning that can be understood by the right personnel. Just connecting sensors to a machine or connecting a machine to another machine will not give users the insights needed to make better decisions. Thus, in this paper we proposed the real time monitoring system that utilized machine learning algorithm to predict the quality of product based on sensor data that was gathered by IoT device and showed the result in real time.</p>\n<p>Published in: KSMTE Annual Autumn Conference 2017 <br/>\nLink: <a href=\"http://www.dbpia.co.kr/Journal/ArticleDetail/NODE07285510\">http://www.dbpia.co.kr/Journal/ArticleDetail/NODE07285510</a></p>","fields":{"slug":"/updates/2017-12-08-Real-time-monitoring-system-based-on-IoT-sensor-data-for-assembly-line-process-in-the-automotive-factory/"},"frontmatter":{"title":"Real time monitoring system based on IoT sensor data for assembly line process in the automotive factory","description":null,"date":"08 December 2017","tags":["paper","conference","manufacturing","machine learning","real-time monitoring"]}}},{"node":{"id":"950cba53-a4ed-5d3e-89ce-f363d1ae208b","html":"<p><strong>Abstract</strong></p>\n<p>Smart factory is quickly becoming the new reality in the market, and every innovative manufacturer must embrace it to stay competitive. To achieve manufacturing innovation in smart factory, manufacturers will have to invest in improving and or utilizing Internet of Things (IoT) to enable real-time data on their processes and their condition – for example, machine state condition or quality problems. One of real-time data that we could gather from the factory is environmental data. Thus, in this study, we develop real-time prediction system based on random forest algorithm to detect the quality problem based on real-time environmental data. Lab data was used to evaluate the performance of the algorithm. In addition, other machine learning algorithms are also applied, and the comparison results are provided.</p>","fields":{"slug":"/updates/2017-11-25-Development-of-Real-time-Prediction-System-Based-on-Random-Forest-Algorithm-in-Smart-Factory/"},"frontmatter":{"title":"Development of Real-time Prediction System Based on Random Forest Algorithm in Smart Factory","description":null,"date":"25 November 2017","tags":["paper","conference","manufacturing","IoT","real-time monitoring","machine learning"]}}},{"node":{"id":"489c2379-d05e-57f3-88bd-2a3065973b54","html":"<p><strong>Abstract</strong></p>\n<p>Currently, the manufacturing industry is experiencing a data-driven revolution. There are multiple processes in the manufacturing industry and will eventually generate a large amount of data. Collecting, analyzing and storing a large amount of data are one of key elements of the smart manufacturing industry. To ensure that all processes within the manufacturing industry are functioning smoothly, the big data processing is needed. Thus, in this study an open source-based real-time data processing (OSRDP) architecture framework was proposed. OSRDP architecture framework consists of several open sources technologies, including Apache Kafka, Apache Storm and NoSQL MongoDB that are effective and cost efficient for real-time data processing. Several experiments and impact analysis for manufacturing sustainability are provided. The results showed that the proposed system is capable of processing a massive sensor data efficiently when the number of sensors data and devices increases. In addition, the data mining based on Random Forest is presented to predict the quality of products given the sensor data as the input. The Random Forest successfully classifies the defect and non-defect products, and generates high accuracy compared to other data mining algorithms. This study is expected to support the management in their decision-making for product quality inspection and support manufacturing sustainability.</p>\n<p>Published in: Sustainability<br/>\nDOI: <a href=\"https://doi.org/10.3390/su9112139\">10.3390/su9112139</a></p>","fields":{"slug":"/updates/2017-11-20-An-Open-Source-Based-Real-Time-Data-Processing-Architecture-Framework-for-Manufacturing-Sustainability/"},"frontmatter":{"title":"An Open Source-Based Real-Time Data Processing Architecture Framework for Manufacturing Sustainability","description":null,"date":"20 November 2017","tags":["paper","journal","manufacturing","big data","IoT","machine learning","real-time monitoring"]}}},{"node":{"id":"9f330968-1c0d-5a03-bf19-fe5caaaa3cdb","html":"<p><strong>Abstract</strong></p>\n<p>Since customer attention is increasing due to growing customer health awareness, it is important for the perishable food supply chain to monitor food quality and safety. This study proposes a real-time monitoring system that utilizes smartphone-based sensors and a big data platform. Firstly, we develop a smartphone-based sensor to gather temperature, humidity, GPS, and image data. The IoT-generated sensor on the smartphone has characteristics such as a large amount of storage, an unstructured format, and continuous data generation. Thus, in this study, we propose an effective big data platform design to handle IoT-generated sensor data. Furthermore, the abnormal sensor data generated by failed sensors is called outliers and may arise in real cases. The proposed system utilizes outlier detection based on statistical and clustering approaches to filter out the outlier data. The proposed system was evaluated for system and gateway performance and tested on the kimchi supply chain in Korea. The results showed that the proposed system is capable of processing a massive input/output of sensor data efficiently when the number of sensors and clients increases. The current commercial smartphones are sufficiently capable of combining their normal operations with simultaneous performance as gateways for transmitting sensor data to the server. In addition, the outlier detection based on the 3-sigma and DBSCAN were used to successfully detect/classify outlier data as separate from normal sensor data. This study is expected to help those who are responsible for developing the real-time monitoring system and implementing critical strategies related to the perishable supply chain.</p>\n<p>Published in: Sustainability<br/>\nDOI: <a href=\"https://doi.org/10.3390/su9112073\">10.3390/su9112073</a>{:target=\"_blank\"}</p>","fields":{"slug":"/updates/2017-11-10-Real-Time-Monitoring-System-Using-Smartphone-Based-Sensors-and-NoSQL-Database-for-Perishable-Supply-Chain/"},"frontmatter":{"title":"Real-Time Monitoring System Using Smartphone-Based Sensors and NoSQL Database for Perishable Supply Chain","description":null,"date":"10 November 2017","tags":["paper","journal","supply chain","IoT","real-time monitoring"]}}},{"node":{"id":"fd7fbd60-fa69-5205-b19b-4f81ac279c65","html":"<p><strong>Abstract</strong></p>\n<p>A carsharing service can be seen as a transport alternative between private and public transport that enables a group of people to share vehicles based at certain stations. The advanced carsharing service, one-way carsharing, enables customers to return the car to another station. However, one-way implementation generates an imbalanced distribution of cars in each station. Thus, this paper proposes forecasting relocation to solve car distribution imbalances for one-way carsharing services. A discrete event simulation model was developed to help evaluate the proposed model performance. A real case dataset was used to find the best simulation result. The results provide a clear insight into the impact of forecasting relocation on high system utilization and the reservation acceptance ratio compared to traditional relocation methods.</p>\n<p>Published in: Applied Sciences<br/>\nDOI: <a href=\"https://doi.org/10.3390/app7060598\">10.3390/app7060598</a></p>","fields":{"slug":"/updates/2017-06-09-Performance-Analysis-of-a-Forecasting-Relocation-Model-for-One-Way-Carsharing/"},"frontmatter":{"title":"Performance Analysis of a Forecasting Relocation Model for One-Way Carsharing","description":null,"date":"09 June 2017","tags":["paper","journal","carsharing","simulation","forecasting"]}}},{"node":{"id":"c7d97510-b546-5af0-a86f-bfd2a3030bf0","html":"<p><strong>Abstract</strong></p>\n<p>In the future, one of the key essential functionality of smart factory is reconfigurable manufacturing. Collecting, analyzing, and monitoring large amounts of sensor data are becoming a key enable technology to implement reconfigurable manufacturing. These day, the manufacturing industry is in the midst of a data-driven revolutionary, which means sensor data has become more accessible, ubiquitous and in the end generating large amounts of stored sensor data. This phenomenon would make it challenging for manufacturing SMEs to store and analyze them into useful and actionable information. However, it is not easy for Small and Medium-sized Enterprises (SMEs) to implement such actions due to their limited budgets and lack of ICT infrastructure. Thus, in this paper, we developed a distributed processing system for real-time sensor data, which is affordable to such manufacturing SMEs. The proposed framework incorporates machinelearning algorithms that could learn from historical sensor data and generate the classifiers which will be used to predict the product quality based on the sensor data. An injection-molding process is used to verify the proposed framework.</p>\n<p>Published in: Proceedings of KSPE 2017 Spring Conference<br/>\nLink: <a href=\"http://www.dbpia.co.kr/Journal/ArticleDetail/NODE07205708\">http://www.dbpia.co.kr/Journal/ArticleDetail/NODE07205708</a></p>","fields":{"slug":"/updates/2017-05-19-Development-of-Distributed-Processing-System-for-Real-time-Sensor-Data/"},"frontmatter":{"title":"Development of Distributed Processing System for Real-time Sensor Data","description":null,"date":"19 May 2017","tags":["paper","conference","big data","manufacturing","IoT","real-time monitoring"]}}},{"node":{"id":"e35b3b4c-1673-590e-984f-80528d03dd51","html":"<p><strong>Abstract</strong></p>\n<p>This paper proposes an eye state detection system using Haar Cascade Classifier and Circular Hough Transform. Our proposed system first detects the face and then the eyes using Haar Cascade Classifiers, which differentiate between opened and closed eyes. Circular Hough Transform (CHT) is used to detect the circular shape of the eye and make sure that the eye is detected correctly by the classifiers. The accuracy of the eye detection is 98.56% on our database which contains 2856 images for opened eye and 2384 images for closed eye. The system works on several stages and is fully automatic. The eye state detection system was tested by several people, and the accuracy of the proposed system is 96.96%.</p>\n<p>Published in: 2016 IEEE 5th Global Conference on Consumer Electronics<br/>\nDOI: <a href=\"https://doi.org/10.1109/GCCE.2016.7800424\">10.1109/GCCE.2016.7800424</a></p>","fields":{"slug":"/updates/2016-10-14-Real-time-eye-state-detection-system-using-haar-cascade-classifier-and-circular-hough-transform/"},"frontmatter":{"title":"Real-time eye state detection system using haar cascade classifier and circular hough transform","description":null,"date":"14 October 2016","tags":["paper","conference","image processing"]}}},{"node":{"id":"ef7724f5-ccd4-5ac4-9321-756abaedfd99","html":"<p><strong>Abstract</strong></p>\n<p>The reconfigurable manufacturing is an essential functionality of smart factories in the future. In order to implement such reconfigurable manufacturing; collecting, analyzing, and monitoring large amounts of sensor data are becoming a key enable technology. And nowadays, the manufacturing industry is in the midst of a data-driven revolution, which means sensor data has become more accessible, ubiquitous and in the end generating large amounts of stored sensor data. This phenomenon would make it challenging for manufacturing SMEs to store and analyze them into useful and actionable information. However, it is not easy for SMEs to implement such actions due to their limited budgets and lack of ICT infrastructure. Thus, in this paper, we proposed a real-time quality prediction service, which is affordable to such manufacturing SMEs. The proposed service incorporates machine-learning algorithms that learn from historical production sensor data and generate the classifiers to determine the product quality patterns. An injection-molding example is illustrated to verify the proposed quality prediction as a service model.</p>","fields":{"slug":"/updates/2016-06-25-A-Quality-Prediction-as-a-Service-for-Manufacturing-Small-and-Medium-sized-Enterprises-(SMEs)/"},"frontmatter":{"title":"A Quality Prediction as a Service for Manufacturing Small and Medium-sized Enterprises (SMEs)","description":null,"date":"25 June 2016","tags":["paper","conference","machine learning","manufacturing","IoT","real-time monitoring"]}}}]}}}