{"data":{"markdownRemark":{"html":"<p>He received the bachelor’s degree from Universitas Islam Negeri Sunan Kalijaga, Yogyakarta, Indonesia, and the Ph.D. degree from Dongguk University, Seoul, South Korea. He is currently an <a target='_blank' alt='Assistant Professor' rel='noopener noreferrer' href='http://ise.dongguk.edu/bbs/board.php?bo_table=ise5_1'>Assistant Professor</a> with the Department of Industrial and Systems Engineering, Dongguk University. He is also an Instructor with popular <a alt='Teaching courses' href='../teaching'>practical course</a> on undergraduate topics in programming languages and database systems. He has collaborated actively with researchers in several other disciplines of engineering, particularly information processing and machine learning on problems at the real-world industrial applications. He was <a target='_blank' alt='SCKD2019' rel='noopener noreferrer' href='http://diaspora.ristekdikti.go.id/sckd-2019/diaspora-peserta-sckd-2019/entry/2319/'>selected and invited to participate with the World Class Scholar Symposium (SCKD) Event</a> hosted by the Ministry of Research, Technology, and Higher Education, Indonesia, in August 2019, to make contributions on accelerating the Indonesian national development. He has published numerous <a alt='List of publications' href='../publication'>research articles</a> in several international peer-reviewed journals, including IEEE ACCESS, Food Control, Sensors, and etc. His research interests include industrial artificial intelligence, machine learning, information systems, edge-computing, the Internet of Things, big data, health informatics, and smart factory ranging from theory to design and implementation. He continously serves as a <a target='_blank' alt='Verified review reports' rel='noopener noreferrer' href='https://publons.com/researcher/1501728/muhammad-syafrudin/'>Reviewer</a>, Topic Editor and Reviewer Board Members for MDPI as well as a Review Editor for the IoT and Sensor Networks (Frontiers in Communications and Networks). Please consider contributing to our Special Issue: <a target='_blank' alt='Special Issue AI healthcare' rel='noopener noreferrer' href='https://mdpi.com/si/58663'>\"Artificial Intelligence for Sustainable Services and Applications\"</i></a>. Thank you for your consideration.</p>","frontmatter":{"title":"Biography","subtitle":"Muhammad Syafrudin"}}}}