{"data":{"markdownRemark":null,"allMarkdownRemark":{"edges":[{"node":{"id":"33d862bc-146b-56d8-8961-07a97bf7e275","html":"<li> Working on R&D of Applied Industrial Artificial Intelligence (AI) for several industries including but not limited to health, manufacturing, supply chain, and ecommerce.\n<li> Publishing the results in the well-known peer-reviewed journals such as Food Control, IEEE Access, Sensors, and etc.\n<li> Teaching course related with Information Systems, Database and Programming.\n<li> Collaborating with colleagues in Industrial AI Research Center at DGU, Seoul Korea.","frontmatter":{"company":"Dongguk University, Seoul","position":"Assistant Professor","startDate":"Mar 2019","endDate":"Present"}}},{"node":{"id":"d8f08c31-a5aa-57f0-a185-909e8e42ae40","html":"<li> Worked on R&D of Applied Big Data, Machine Learning, and Edge Computing for various projects such as Smart Manufacturing, Healthcare, Supply Chain and Ecommerce.\n<li> Published the results in the well-known peer-reviewed journals such as Sensors, Applied Sciences, Sustainability and etc.\n<li> Assisted several courses related with Applied Deep Learning (CNN and LSTM), Intro to Python Programming, NoSQL and Big Data (Hadoop, MongoDB, Storm, Kafka).","frontmatter":{"company":"Dongguk University, Seoul","position":"Researcher","startDate":"Mar 2014","endDate":"Feb 2019"}}},{"node":{"id":"6021b059-4772-5c1d-8589-486416f72bd3","html":"<p>Designed, developed and implemented various systems and services such as:</p>\n<li> Alumni information system: to better serve the alumni in connecting with their almamater as well as their fellow friends\n<li> Lab information system: to better serve the student in getting a Laboratory Free Certificate to be used for fulfilling one of the graduation requirements\n<li> Pre-graduation check and registration services: to better serve the student in checking their state of graduation requirements as well as can be used to register for graduation ceremony in the ongoing academic year","frontmatter":{"company":"UIN Sunan Kalijaga, Yogyakarta","position":"Web Developer","startDate":"Jul 2012","endDate":"Feb 2014"}}},{"node":{"id":"80e9e40f-877d-5aa1-88fe-16c37bd41666","html":"<p>Assisted several courses such as:</p>\n<li> Jan 2011–June 2011: Operating System (Linux)\n<li> Sept 2011–Jan 2012: Structured Programming (C language)\n<li> Sept 2011–Jan 2012: Object Oriented Programming (Java language)\n<li> Feb 2012–June 2012: Web Programming (PHP & MySQL)\n<li> Feb 2012–June 2012: Databases (Oracle & MySql)\n<li> Sept 2012–Jan 2013: Computer Network (Linux)","frontmatter":{"company":"UIN Sunan Kalijaga, Yogyakarta","position":"Teaching Assistant","startDate":"Jan 2011","endDate":"Jan 2013"}}}]}}}